ode-bpel-soap/bpelContent/Forecast.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. -->
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/Forecast/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.wscomposition.org/Forecast/" name="Forecast">
    <types />
    <message name="ForecastRequest">
        <part name="q" type="xsd:string" />
        <part name="cnt" type="xsd:int" />
        <part name="units" type="xsd:string" />
    </message>
    <message name="ForecastRequestResponse">
        <part name="ForecastResponse" type="xsd:string" />
    </message>
    <portType name="Forecast">
        <operation name="ForecastRequest" parameterOrder="q cnt units">
            <input wsam:Action="http://www.wscomposition.org/Forecast/Forecast/ForecastRequestRequest" message="tns:ForecastRequest" />
            <output wsam:Action="http://www.wscomposition.org/Forecast/Forecast/ForecastRequestResponse" message="tns:ForecastRequestResponse" />
        </operation>
    </portType>
    <binding name="ForecastSOAPBinding" type="tns:Forecast">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
        <operation name="ForecastRequest">
            <soap:operation soapAction="" />
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Forecast/" />
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/Forecast/" />
            </output>
        </operation>
    </binding>
    <service name="Forecast">
        <port name="ForecastSOAP" binding="tns:ForecastSOAPBinding">
            <soap:address location="http://localhost:9003/soapwrapper/Forecast" />
        </port>
    </service>
</definitions>